In [63]:
!pip install SQLALchemy==2.0.29

6569.06s - pydevd: Sending message related to process being replaced timed-out after 5 seconds

Requirement already satisfied: SQLALchemy==2.0.29 in /usr/local/python/3.12.1/lib/python3.12/site-packages (2.0.29)
Requirement already satisfied: typing-extensions>=4.6.0 in /home/codespace/.local/lib/python3.12/site-packages (from SQLALchemy==2.0.29) (4.15.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/python/3.12.1/lib/python3.12/site-packages (from SQLALchemy==2.0.29) (3.3.0)

In [1]:
!pip install mysql-connector-python==8.3.0

Collecting mysql-connector-python==8.3.0
  Downloading mysql_connector_python-8.3.0-cp312-cp312-manylinux_2_17_x86_64.whl.metadata (1.9 kB)
Downloading mysql_connector_python-8.3.0-cp312-cp312-manylinux_2_17_x86_64.whl (21.5 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 21.5/21.5 MB 29.8 MB/s  0:00:00m0:00:010:01
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.3.0

In [3]:
!pip install mysqlclient==2.2.4

Collecting mysqlclient==2.2.4
  Downloading mysqlclient-2.2.4.tar.gz (90 kB)
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Preparing metadata (pyproject.toml) ... done
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (pyproject.toml) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.2.4-cp312-cp312-linux_x86_64.whl size=133331 sha256=984af848ff717541b8ab27f0f434bd6dbbcfe21d9e1f1d04fb2dbc65f8a921ea
  Stored in directory: /home/codespace/.cache/pip/wheels/20/6f/c3/3b23bb01988b1c0bea0668e2116315ce43ced2179724ab593e
Successfully built mysqlclient
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.2.4

In [6]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp312-cp312-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl.metadata (91 kB)
Collecting numpy>=1.26.0 (from pandas)
  Downloading numpy-2.3.5-cp312-cp312-manylinux_2_27_x86_64.manylinux_2_28_x86_64.whl.metadata (62 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: tzdata>=2022.7 in /home/codespace/.local/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /home/codespace/.local/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp312-cp312-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl (12.4 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 12.4/12.4 MB 25.5 MB/s  0:00:00m0:00:010:01
Downloading numpy-2.3.5-cp312-cp312-manylinux_2_27_x86_64.manylinux_2_28_x86_64.whl (16.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 16.6/16.6 MB 45.0 MB/s  0:00:006m0:00:01
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Installing collected packages: pytz, numpy, pandas
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3/3 [pandas]2m2/3 [pandas]
Successfully installed numpy-2.3.5 pandas-2.3.3 pytz-2025.2

In [1]:
import pandas as pd 
import sqlalchemy as db

##from sqlalchemy import text

In [7]:
## Crear Conexion 
## Cadena: usuario,clave,host o servidor, puerto nombre de la bd
engine = db.create_engine("mysql://root:root@127.0.0.1:3310/db_movies_netflix_transact")
## Establecemos o iniciamos la ejecucion
conn = engine.connect()

Cargando datos a la dimension Moview

In [2]:
query = """
SELECT
    movie.movieID AS movieID,
    movie.movieTitle AS title,
    movie.releaseDate AS releaseDate,
    gender.name AS gender,
    person.name AS participantName,
    participant.participantRole AS roleParticipant
FROM movie
INNER JOIN participant
    ON movie.movieID = participant.movieID
INNER JOIN person
    ON person.personID = participant.personID
INNER JOIN movie_gender
    ON movie.movieID = movie_gender.movieID
INNER JOIN gender
    ON movie_gender.genderID = gender.genderID
"""

In [8]:
## cargar los resultados con la consulta DF

movies_data = pd.read_sql(query, conn)

## Transformar a Entero 
movies_data["movieID"]= movies_data["movieID"].astype('int')

## Mostrar los elementos
movies_data

,movieID,title,releaseDate,gender,participantName,roleParticipant
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director

In [29]:
# Cargar CSV
import pandas as pd

movies_awards = pd.read_csv("../data/Awards_movie.csv")

## Transformar el id a entero

movies_awards["movieID"] = movies_awards["movieID"].astype('int')

## renombrar una columna

movies_awards.rename(columns={"Aware": "Award"}, inplace=True)

movies_awards

    movieID  IdAward   Award
0  80210920        0   Oscar
1  81157374        1  Grammy
2  80192187        2   Oscar

In [30]:
## Vamos a Cruzar la informacion join

movie_data_final = pd.merge(
    movies_data,movies_awards,
    left_on="movieID",right_on="movieID"
)

movie_data_final

,movieID,title,releaseDate,gender,participantName,roleParticipant,IdAward,Award
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,2,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,0,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,1,Grammy

In [31]:
## Crear Conexion 2 a  la dw_netflix
## Cadena: usuario,clave,host o servidor, puerto nombre de la bd
engine = db.create_engine("mysql://root:root@127.0.0.1:3310/dw_netflix")
## Establecemos o iniciamos la ejecucion
conn = engine.connect()

In [34]:
#Renombrar 2 columnas
movie_data_final = movie_data_final.rename(
    columns={
        "releaseDate": "releaseMovie",
        "Award": "awardMovie"
    }
)

#Eliminar campo
movie_data_final = movie_data_final.drop(columns=["IdAward"])

In [35]:
movie_data_final

,movieID,title,releaseMovie,gender,participantName,roleParticipant,awardMovie
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,Oscar
1,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,Oscar
2,81157374,Run,2021-05-21,Adventure,aria Lopez Gutierrez,Director,Grammy

In [ ]:
## Insertmamos a la tabla 
movie_data_final.to_sql('dimMovie',conn,if_exists='append', index=False)

3

Cargar Dimension USER

In [43]:
users = pd.read_csv("../data/users.csv",sep="|")
users.head(7)

    idUser     username    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium
5  1002336   musicLover     France        Basic
6  1002337     foodie88      Italy      Premium

In [45]:
## renombrar la tabla usuarios

users = users.rename(columns = {"idUser": "userID"})
                              
users.head()

    userID     username    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [ ]:
## Insertar a la base de datos
##Cadena = tabla,conexion,accion,index
users.to_sql("dimUser", conn, if_exists="append", index=False)

20

Cargar los datos a la tabla Hechos

In [53]:
users_id = users["userID"]
movies_id = movie_data_final["movieID"]

In [54]:
users_id.head()

0    1002331
1    1002332
2    1002333
3    1002334
4    1002335
Name: userID, dtype: int64

In [55]:
movies_id.head()

0    80192187
1    80210920
2    81157374
Name: movieID, dtype: int64

In [58]:
watchs_data = pd.merge(users_id, movies_id, how="cross")

watchs_data

      userID   movieID
0    1002331  80192187
1    1002331  80210920
2    1002331  81157374
3    1002332  80192187
4    1002332  80210920
5    1002332  81157374
6    1002333  80192187
7    1002333  80210920
8    1002333  81157374
9    1002334  80192187
10   1002334  80210920
11   1002334  81157374
12   1002335  80192187
13   1002335  80210920
14   1002335  81157374
15   1002336  80192187
16   1002336  80210920
17   1002336  81157374
18   1002337  80192187
19   1002337  80210920
20   1002337  81157374
21   1002338  80192187
22   1002338  80210920
23   1002338  81157374
24   1002339  80192187
25   1002339  80210920
26   1002339  81157374
27  10023310  80192187
28  10023310  80210920
29  10023310  81157374
30  10023311  80192187
31  10023311  80210920
32  10023311  81157374
33  10023312  80192187
34  10023312  80210920
35  10023312  81157374
36  10023313  80192187
37  10023313  80210920
38  10023313  81157374
39  10023314  80192187
40  10023314  80210920
41  10023314  81157374
42  10023315  80192187
43  10023315  80210920
44  10023315  81157374
45  10023316  80192187
46  10023316  80210920
47  10023316  81157374
48  10023317  80192187
49  10023317  80210920
50  10023317  81157374
51  10023318  80192187
52  10023318  80210920
53  10023318  81157374
54  10023319  80192187
55  10023319  80210920
56  10023319  81157374
57  10023320  80192187
58  10023320  80210920
59  10023320  81157374

In [ ]:
## Generamos data test apartir de datos random

import random
from datetime import datetime,timedelta

def get_rating():
    numero_aleatorio= round(random.uniform(0,5),1)

    return numero_aleatorio
def gen_timestamp():
    star_date = datetime(2024,1,15)
    end_date = datetime(2024,4,16)

    random_date = star_date + timedelta(seconds=random.randint(0, int((end_date - star_date).total_seconds())))

    return random_date

In [60]:
watchs_data['rating'] = watchs_data["movieID"].apply(lambda x: get_rating())

watchs_data['timestamp'] = watchs_data["userID"].apply(lambda x: gen_timestamp())

In [61]:
watchs_data.head()

    userID   movieID  rating           timestamp
0  1002331  80192187     1.8 2024-04-03 21:22:04
1  1002331  80210920     0.3 2024-04-08 15:23:29
2  1002331  81157374     3.0 2024-04-10 07:07:15
3  1002332  80192187     2.5 2024-02-24 16:36:33
4  1002332  80210920     4.6 2024-03-03 14:00:20

In [62]:
watchs_data.to_sql("FactWatchs",conn,if_exists="append",index=False)

60